{
  "identity": {
    "name": "Edgar Colmenero",
    "descriptor": "Product-minded software engineer shipping reliable systems.",
    "status": "Available for senior product engineering roles",
    "focus": [
      "Full-stack engineering",
      "Front-end systems",
      "Automation & agents",
      "Data-driven applications",
      "Performance & UX"
    ],
    "metrics": {
      "experience": 8,
      "projects": 32,
      "technologies": 26
    }
  },
  "timeline": [
    {
      "title": "Senior Product Engineer",
      "organization": "SwiftSend",
      "time": "2023 — Present",
      "impact": "Designed and built delivery automation features and a workflow rules engine that removed manual dispatch for 65% of orders and shortened SLA breach escalations from hours to minutes.",
      "tags": ["TypeScript", "Node.js", "Rules engine", "Platform APIs"]
    },
    {
      "title": "Full-Stack Engineer",
      "organization": "Ravi’s Import Warehouse",
      "time": "2021 — 2023",
      "impact": "Partnered with executives to ship an e-commerce relaunch with inventory syncing, PDP personalization, and fulfillment dashboards; lifted online revenue by 28% YoY and reduced support tickets by 18%.",
      "tags": ["Next.js", "React", "PostgreSQL", "Stripe"]
    },
    {
      "title": "Systems Analyst",
      "organization": "Wells Fargo",
      "time": "2019 — 2021",
      "impact": "Supported customer operations platforms, mapped data contracts between servicing teams, and automated compliance checks that cut manual QA cycles by two days per release.",
      "tags": ["Process automation", "SQL", "Data mapping", "Compliance"]
    },
    {
      "title": "Team Lead, Digital Ops",
      "organization": "Walmart",
      "time": "2016 — 2019",
      "impact": "Led a frontline team rolling out new handheld tooling; improved pick-path accuracy, mentored associates into tech-facing roles, and established feedback loops with product owners.",
      "tags": ["Leadership", "Operational efficiency", "Training", "Customer focus"]
    },
    {
      "title": "Computing Foundations + Portfolio Projects",
      "organization": "University & Personal",
      "time": "2014 — 2016",
      "impact": "Completed academic coursework while building portfolio projects focused on interaction design, data visualization, and automation-first product thinking.",
      "tags": ["JavaScript", "Python", "Data viz", "Accessibility"]
    }
  ],
  "projects": [
    {
      "name": "SwiftSend automation suite",
      "description": "Workflow rules, courier selection, and live-tracking overlays that keep dispatch hands-free while surfacing operational risk early.",
      "stack": ["TypeScript", "Node.js", "PostgreSQL", "Web Workers"],
      "outcome": "Reduced failed handoffs and ensured on-time delivery SLAs for regional partners.",
      "status": "live",
      "image": ""
    },
    {
      "name": "Ravi’s Import Warehouse e-commerce",
      "description": "Full-stack rebuild with performance budgets, inventory sync, and executive-friendly analytics to align merchandising and ops.",
      "stack": ["Next.js", "React", "Stripe", "Edge caching"],
      "outcome": "Launched a durable storefront that increased conversion and cut support contacts.",
      "status": "live",
      "image": ""
    },
    {
      "name": "Agentic QA + ops automations",
      "description": "Built lightweight agent flows to validate UI states, summarize incident logs, and trigger runbooks without interrupting teams.",
      "stack": ["JavaScript", "Workers", "Playwright", "Prompt tooling"],
      "outcome": "Lowered regression detection time and reduced manual QA passes before release windows.",
      "status": "in progress",
      "image": ""
    },
    {
      "name": "This resume site",
      "description": "Compact, data-driven profile with worker-powered counters, SVG accents, and resilient loading that mirrors how I ship products.",
      "stack": ["HTML", "CSS", "Vanilla JS", "Web Workers"],
      "outcome": "Shows approach to thoughtful defaults, accessibility, and composable UI behavior.",
      "status": "live",
      "image": ""
    }
  ],
  "accomplishments": [
    "Led dispatch and storefront programs with cross-functional partners while coaching teammates into broader technical ownership.",
    "Implemented automation and observability guardrails that shortened QA cycles and improved deployment confidence.",
    "Built reusable design patterns and dashboards that aligned leadership with the state of operations in near real-time.",
    "Balanced academic foundations with hands-on product delivery, focusing on data-informed decisions and accessibility."
  ],
  "roadmap": [
    {
      "phase": "Now",
      "summary": "Polishing portfolio storytelling, contributing to platform reliability work, and applying to teams shipping customer-facing systems."
    },
    {
      "phase": "Next",
      "summary": "Deepening backend reliability patterns, expanding observability for automation flows, and pairing with designers on motion and accessibility." 
    },
    {
      "phase": "Later",
      "summary": "Pursuing senior engineering tracks focused on systems leadership, resilient automation, and thoughtful product delivery at scale."
    }
  ]
}
